
Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверка проведения:
	//1. Проверить на повторяющиеся эелементы в ТЧ
	ОбщегоНазначения.ПроверитьНаОдинаковыеПозиции(Книги, Отказ);
	//2. Проверить нет ли уже таких остатков в библиотеке
	ОбщегоНазначения.ПроверитьОстаткиНаОтсутствие(ЭтотОбъект, Отказ);
	//3. Проверить установлена ли дата выдачи если расположение у абонента
	ОбщегоНазначения.ПроверитьДатуВыдачи(ЭтотОбъект, Отказ);
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КнигиВБиблиотеке Приход
	Движения.КнигиВБиблиотеке.Записывать = Истина;
	Для Каждого ТекСтрокаКниги Из Книги Цикл		
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;
		Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
		Движение.Количество = 1;
		Движение.Операция = Перечисления.Операция.ПоступлениеКниг;
		//Если размещение книги у абонента, то сделаем расход
		Если ТекСтрокаКниги.МестоРазмещения <> Справочники.МестаРазмещения.Библиотека Тогда   			
			//вычтим с библиотеки			
			Движение = Движения.КнигиВБиблиотеке.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекСтрокаКниги.ДатаВыдачи;
			Движение.Книга = ТекСтрокаКниги.Книга;
			Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
			Движение.Количество = 1;
			Движение.Операция = Перечисления.Операция.ВыдачаКнигиАбоненту;
			//и добавим абоненту
			Движение = Движения.КнигиВБиблиотеке.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТекСтрокаКниги.ДатаВыдачи;
			Движение.Книга = ТекСтрокаКниги.Книга;
			Движение.МестоРазмещения = ТекСтрокаКниги.МестоРазмещения;
			Движение.Количество = 1;
			Движение.Операция = Перечисления.Операция.ВыдачаКнигиАбоненту;		
		КонецЕсли;
	КонецЦикла;	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
