
// Получает значение константы, необходимо например для получения значения на клиенте
//
// Параметры
//  <ИмяКонстанты>  - <Строка> - <описание параметра>
//
// Возвращаемое значение:
//   <Произвольный>   - <значение константы>
//
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт

	Возврат Константы[ИмяКонстанты].Получить();

КонецФункции // ПолучитьЗначениеКонстанты()

// У пользователя с ролью Абонент убирает панель разделов т.к. она пустая
// 
// Возвращаемое значение:
//  Булево - Истина, если панель скрывалась и необходим обновить интерфейс
Функция СкрытьПанельРазделовДляАбонента() Экспорт

	РезультатОперации = Ложь;

	Если РольДоступна(Метаданные.Роли.Абонент) Тогда
		НастройкиПользователя = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , , ИмяПользователя());
		НастройкиПользователя = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
		НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
		НастройкиПользователя.УстановитьСостав(НастройкиСостава);
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", НастройкиПользователя);
		РезультатОперации = Истина;
	КонецЕсли;

	Возврат РезультатОперации;

КонецФункции