//процедура очизает табличную часть и заполняет всеми книгами
&НаКлиенте
Процедура ЗаполнитьИзСправочника(Команда)	
	Если Вопрос("Будет очищена табичная часть. Продолжить?", РежимДиалогаВопрос.ДаНет,0) = КодВозвратаДиалога.Нет ТОгда
		Возврат;
	КонецЕсли;
	Объект.Книги.Очистить();	
	ЗаполнитьТЧКниги();	
КонецПроцедуры

//процедура заполняет табличную часть документа книгами из справочника
&НаСервере
Процедура ЗаполнитьТЧКниги()
	Документ = РеквизитФормыВЗначение("Объект");
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Книги.Ссылка
		|ИЗ
		|	Справочник.Книги КАК Книги";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка = Документ.Книги.Добавить();
		Строка.Книга = ВыборкаДетальныеЗаписи.Ссылка;
		Строка.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	ЗначениеВРеквизитФормы(Документ, "Объект");
КонецПроцедуры
