&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ИмяМакета) Тогда
		ВерсияКонфигурации = ОбновлениеКонфигурацииСервер.ПолучитьВерсиюКонфигурации();
		// 02.03.2018
		// Теперь на каждый выпуск увеличиваю версию, а каждое помещение в хранилище это увеличение релиза
		// Потому теперь макеты именуются только в формате Редакция_Подредакция_верси (1_0_3)
		НомераВерсий = СтрРазделить(ВерсияКонфигурации, ".");
		Параметры.ИмяМакета = "ИзмененияВВерсии";
		Для Индекс = 0 По 2 Цикл
			Параметры.ИмяМакета = Параметры.ИмяМакета + "_" + НомераВерсий[Индекс];
		КонецЦикла;
	КонецЕсли;
	Шапка = Обработки.ОбновлениеКонфигурации.ПолучитьМакет("ШапкаТабличногоДокумента");
	Макет = Обработки.ОбновлениеКонфигурации.ПолучитьМакет(Параметры.ИмяМакета);
	ПолеТабличногоДокумента.Вывести(Шапка);
	ПолеТабличногоДокумента.Присоединить(Макет);
	
КонецПроцедуры
