
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Объект.Ссылка);
	
	МассивОбъектов = НайтиПоСсылкам(МассивСсылок).ВыгрузитьКолонку("Данные");
	
	Для Каждого ОбъектИспользующийФайл Из МассивОбъектов Цикл
		НоваяСтрока = ОбъектыИспользующиеФайл.Добавить();
		НоваяСтрока.Объект = ОбъектИспользующийФайл;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыИспользующиеФайлВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элементы.ОбъектыИспользующиеФайл.ТекущиеДанные.Объект);
	
КонецПроцедуры
