// Создает новое издательство
//
// Параметры:
//  Наименование  - <Строка> - наименование издателя
//
// Возвращаемое значение:
//   <СправочникСсылка.Издатели>   - созданное издательство
//
Функция СоздатьИздательство(Наименование) Экспорт
	
	ИздательОбъект = Справочники.Издательства.СоздатьЭлемент();
	ИздательОбъект.Наименование = Наименование;
	Попытка
		ИздательОбъект.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось создать издательство";
		СообщениеПользователю.Сообщить();
		ОбщегоНазначения.ЗафиксироватьОшибку(СообщениеПользователю.Текст, ОписаниеОшибки, Метаданные.Справочники.Издательства, Наименование);
	КонецПопытки;
	
	Возврат ИздательОбъект.Ссылка;
	
КонецФункции // СоздатьИздателя()
