#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда // Для работы толстого клиента https://its.1c.ru/db/v8std#content:680:hdoc

// Создает новое издательство
//
// Параметры:
//  Наименование  - <Строка> - наименование издателя
//
// Возвращаемое значение:
//   <СправочникСсылка.Издатели>   - созданное издательство
//
Функция СоздатьИздательство(Наименование) Экспорт
	
	ИздательОбъект = Справочники.Издательства.СоздатьЭлемент();
	ИздательОбъект.Наименование = Наименование;
	Попытка
		ИздательОбъект.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = НСтр("ru = 'Не удалось создать издательство'");
		СообщениеПользователю.Сообщить();
		ОбщегоНазначенияСервер.ЗафиксироватьОшибку(СообщениеПользователю.Текст, ОписаниеОшибки, Метаданные.Справочники.Издательства, Наименование);
	КонецПопытки;
	
	Возврат ИздательОбъект.Ссылка;
	
КонецФункции // СоздатьИздателя()

#КонецЕсли
