// Функция получает информацию какие версию обновляются и взависимости от этого 
// запускает определенные процедуры предназначенные для обновления конкретных версий
Функция ВыполнитьОбновлениеКонфигурации() Экспорт
	
	Результат = Истина;
	
	// Выполним первоначальное заполнение базы - попросим указать путь до исполняемого файла.
	Если ОбновлениеКонфигурацииСервер.ПолучитьЗарегистрированнуюВерсиюКонфигурации() = "0.0.0.0" Тогда
		Результат = ВыполнитьПервоначальноеЗаполнениеБазы();
	КонецЕсли;

	// Секция процедур обновлений
	Если НЕ ОбновлениеКонфигурацииСервер.ПолучитьЗарегистрированнуюВерсиюКонфигурации() =  ОбновлениеКонфигурацииСервер.ПолучитьВерсиюКонфигурации() Тогда		
		// Получим версии которые надо обработать при обновлении
		МассивВерсийКОбновлению = МассивВерсийДляОбновления();
		// Последовательно выполним все итерации обновлений
		Для каждого Версия из МассивВерсийКОбновлению цикл
			Если  Версия = "1.0.1.2" Тогда
				//здесь должно быть обновление для конкретной версии
				Результат = ВыполнитьОбновление_1_0_1_2();
			ИначеЕсли Версия = "1.0.1.3" Тогда
				//здесь должно быть обновление для конкретной версии
				Результат = ВыполнитьОбновление_1_0_1_3();
			ИначеЕсли Версия = "1.0.2.1" Тогда
				//здесь должно быть обновление для конкретной версии
				Результат = ВыполнитьОбновление_1_0_2_1();
			ИначеЕсли Версия = "1.0.3" Тогда
				//здесь должно быть обновление для конкретной версии
				Результат = ВыполнитьОбновление_1_0_3();
			КонецЕслИ;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ВыполнитьОбновлениеКонфигурации()

// Выдает массив версий, которые требуют выполнение обработок при обновлении
// то есть выдает все версии с версии, указанной в константе до текущей версии метаданных
//
// Параметры нет
//
// Возвращаемое значение:
//   <массив строк>   - версии конфигурации
//
Функция МассивВерсийДляОбновления()

	// !!ПРИ ДОБАВЛЕНИИ ВЕРСИЙ РАСПОЛОГАЙТЕ НОВЫЕ ВЕРСИИ ВВЕРХУ
	МассивВерсий = Новый Массив;	
	МассивВерсий.Добавить("1.0.4");
	МассивВерсий.Добавить("1.0.3");
	МассивВерсий.Добавить("1.0.2.1");
	МассивВерсий.Добавить("1.0.1.3");
	МассивВерсий.Добавить("1.0.1.2");
	МассивВерсий.Добавить("1.0.1.1");
	МассивВерсий.Добавить("0.0.2.4");
	МассивВерсий.Добавить("0.0.2.3");
		
	МассивВерсийКОбновлению = Новый Массив;
	ВерсияКонфигурации = ОбновлениеКонфигурацииСервер.ПолучитьЗарегистрированнуюВерсиюКонфигурации();
	Для каждого Версия из МассивВерсий цикл 
		Если СтрНайти(ВерсияКонфигурации, Версия) > 0 Тогда 
			Прервать;
		КонецЕслИ;
		МассивВерсийКОбновлению.Добавить(Версия);
	КонецЦикла;
	
	Возврат МассивВерсийКОбновлению;
	
КонецФункции // МассивВерсийДляОбновления()

// Выполняет первоначальное заполнение базы
//
Функция ВыполнитьПервоначальноеЗаполнениеБазы()
	
	// Установим константы для доступа к серверу обслуживания
	Константы.СсылкаНаОписаниеВебСервисовСервераОбслуживания.Установить("http://ghostaz.no-ip.org/maintenance_server/ws/WebService?wsdl");
	Константы.ИмяСервисаСервераОбслуживания.Установить("WebService");
	Константы.ИмяПортаСервераОбслуживания.Установить("WebServiceSoap");
	Константы.ПространствоИменСервераОбслуживания.Установить("http://ghostaz.no-ip.org");
	Константы.ПользовательСервераОсблуживания.Установить("WebService");
	Константы.ПарольСервераОбслуживания.Установить("qwerty123");
		
	Возврат Истина;
	
КонецФункции // ПервоначальноеЗаполнениеБазы()

// Выполняет действия по обновлению на версию 1.0.1.2
//
// Параметры нет
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВыполнитьОбновление_1_0_1_2()

	Возврат Истина;
	
КонецФункции // ВыполнитьОбновление_1_0_1_2()

// Выполняет действия по обновлению на версию 1.0.1.3
//
// Параметры нет
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВыполнитьОбновление_1_0_1_3()

	Возврат Истина;
	
КонецФункции // ВыполнитьОбновление_1_0_1_3()

// Выполняет действия по обновлению на версию 1.0.2.1
//
// Параметры нет
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВыполнитьОбновление_1_0_2_1()

	Константы.МестоХраненияФайлов.Установить(Перечисления.МестаХраненияФайлов.ИнформационнаяБаза);
	
	Константы.ДопустимыеРасширенияФайлов.Установить("jpg; png; gif; pdf; djvu; txt");
	
	Возврат Истина;
	
КонецФункции // ВыполнитьОбновление_1_0_2_1()

// Выполняет действия по обновлению на версию 1.0.3
//
// Параметры нет
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВыполнитьОбновление_1_0_3()

	Константы.АдресФайлаКаталогаКниг.Установить("http://static.ozone.ru/multimedia/feeds/facet/div_book/1132527.zip");
	
	Возврат Истина;
	
КонецФункции // ВыполнитьОбновление_1_0_3()

