// Возвращает тип платформы
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   ТипПлатформы - Тип платформы
//
Функция ТипПлатформы() Экспорт

	РезультатОперации = Неопределено;
	
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	
	Если ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Windows_x86 
		Или ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		РезультатОперации = Перечисления.ТипПлатформы.Windows;
	ИначеЕсли ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Linux_x86 
		Или ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		РезультатОперации = Перечисления.ТипПлатформы.Linux
	ИначеЕсли ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.MacOS_x86 
		Или ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
		РезультатОперации = Перечисления.ТипПлатформы.MacOS;
	КонецЕсли;
	
	Возврат РезультатОперации;

КонецФункции // ТипПлатформы()
