#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда // Для работы толстого клиента https://its.1c.ru/db/v8std#content:680:hdoc

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Книги.Книга
		|ПОМЕСТИТЬ Книги
		|ИЗ
		|	&Книги КАК Книги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КнигиВБиблиотекеОстатки.Книга,
		|	КнигиВБиблиотекеОстатки.МестоРазмещения,
		|	КнигиВБиблиотекеОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.КнигиВБиблиотеке.Остатки(&Период, ) КАК КнигиВБиблиотекеОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Книги КАК Книги
		|		ПО КнигиВБиблиотекеОстатки.Книга = Книги.Книга
		|ГДЕ
		|	КнигиВБиблиотекеОстатки.КоличествоОстаток = 1";

	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Книги", Книги.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	// Регистр КнигиВБиблиотеке Расход
	Движения.КнигиВБиблиотеке.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Книга = ВыборкаДетальныеЗаписи.Книга;
		Движение.МестоРазмещения = ВыборкаДетальныеЗаписи.МестоРазмещения;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Движение.Операция = Перечисления.Операция.СписаниеКниг;	
	КонецЦикла;
	
КонецПроцедуры

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
