
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//Константы.УникальныйИдентификаторБазы.Установить(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));	
	Если НЕ ПустаяСтрока(ПользователиИнформационнойБазы.ТекущийПользователь().Имя) Тогда
		//если пользовательесть попытаемся найти его в справочнике	
		ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
		
		Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество()= 1 Тогда
			//пользователь найден, получим его ссылку
			ПараметрыСеанса.ТекущийПользователь = Результат[0].Ссылка;	
		ИначеЕсли  Результат.Количество() > 1 Тогда
			//несколько одинаковых пользователей
			Сообщить("В справочнике пользователей имеется два одинаковых пользователя");
		Иначе
			//пользователь не найден - СОЗДАДИМ		
			Пользователь = Справочники.Пользователи.СоздатьЭлемент();
			Пользователь.Наименование = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
			Пользователь.ПолноеНаименование = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
			Пользователь.ИдентификаторПользователяИБ = ИдентификаторПользователяИБ;
			Пользователь.Записать();			
		КонецЕсли;
			
		Иначе
			ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
КонецПроцедуры
