
// Функция формирует получает максимальынй инвентраный номер
&НаСервере
Функция ПолучитьМаксимальныйИнвентарныйНомер() Экспорт
	
	МаксНомер = 0;
	Если ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Книги.ИнвентарныйНомер КАК ИнвентарныйНомер
		|ИЗ
		|	Справочник.Книги КАК Книги
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИнвентарныйНомер УБЫВ";
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МаксНомер = ВыборкаДетальныеЗаписи.ИнвентарныйНомер;
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Книги.ИнвентарныйНомер КАК ИнвентарныйНомер
		|ИЗ
		|	Справочник.Книги КАК Книги
		|ГДЕ
		|	Книги.Ссылка <> &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИнвентарныйНомер УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МаксНомер = ВыборкаДетальныеЗаписи.ИнвентарныйНомер;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МаксНомер;
	
КонецФункции

Процедура УстановитьИнвентарынйНомер() Экспорт
	
	ЭтотОбъект.ИнвентарныйНомер = Число(ПолучитьМаксимальныйИнвентарныйНомер()) + 1;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
			НоваяСтрока = Авторы.Добавить();
			НоваяСтрока.Автор = ДанныеЗаполнения.Автор;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Издательство") Тогда
			Издательство = ДанныеЗаполнения.Издательство;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
