Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗначениеЗаполнено(ЭтотОбъект.Отбор.Книга.Значение)
		И ЗначениеЗаполнено(ЭтотОбъект.Отбор.Пользователь.Значение)
		И Не ЗначениеЗаполнено(ЭтотОбъект.Отбор.ИдентификаторЗакладки.Значение) Тогда

		ИдентификаторЗакладки = Строка(Новый УникальныйИдентификатор);
		ЭтотОбъект.Отбор.ИдентификаторЗакладки.Установить(ИдентификаторЗакладки);
		
		Для Каждого Строка Из ЭтотОбъект Цикл
			Если Не ЗначениеЗаполнено(Строка.ИдентификаторЗакладки) Тогда
				Строка.ИдентификаторЗакладки = ИдентификаторЗакладки;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры