
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Только полные права могут менять пользователя
	Если Не РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		
		Элементы.Пользователь.Видимость = Ложь;
		
		// Запретим смену книги. Полным правам все доступно
		Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения)Тогда
			Элементы.Книга.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// При копировании надо очистить уникальный идентификатор, чтобы не было конфликта при записи
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Запись.ИдентификаторЗакладки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры