
// Возвращает короткое имя файла
//
// Параметры:
//  ПолноеИмяФайла - Строка - Путь к файлу + имя файла
//
// Возвращаемое значение:
//   Строка   - Короткое имя файла
//
Функция КороткоеИмяФайлаИзПолногоПути(ПолноеИмяФайла) Экспорт
	
	Если ОбщегоНазначенияВызовСервераПовтИсп.ТипПлатформы() = ПредопределенноеЗначение("Перечисление.ТипПлатформы.Windows") Тогда
		Слеш = "\";
	Иначе
		Слеш = "/";
	КонецЕсли;
	
	ЧастиИмениФайла = СтрРазделить(ПолноеИмяФайла, Слеш);
	
	Возврат ЧастиИмениФайла[ЧастиИмениФайла.Количество()-1];
	
	
КонецФункции // КороткоеИмяФайлаИзПолногоПути()
