
// Сохраняет на сервере загруженный пользователем файл, который в данный момент находится во временном хранилище,
// после этого создает элемент справочника Файлы.
// Возвращает ссылку на элемент справочника.
// Параметры:
//  АдресВХранилище		- Строка - Адрес во временном хранилище, куда был помещен файл с клиента
//  КороткоеИмяФайла	- Строка - Название файла на клиенте
//
// Возвращаемое значение:
//  СправочникСсылка.Файлы - Ссылка на созданный файл
// 
Функция ЗагрузитьФайл(АдресВХранилище, КороткоеИмяФайла) Экспорт
	
	ИдентификаторФайла = Новый УникальныйИдентификатор();
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ЧастиИмениФайла = СтрРазделить(КороткоеИмяФайла, ".");
	РасширениеФайла = ЧастиИмениФайла[1];
	
	// Получим файл из временного хранилища
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	РазмерФайла = ДанныеФайла.Размер();
	
	МаксимальныйРазмерФайла = Константы.МаксимальныйРазмерФайла.Получить();
	
	Если МаксимальныйРазмерФайла > 0 Тогда
		Если РазмерФайла > МаксимальныйРазмерФайла Тогда
			Сообщить(НСтр("ru = 'Допускаются файлы размером до '") + Строка(МаксимальныйРазмерФайла/1024) + НСтр("ru = ' Кб'"));
			Возврат Справочники.Файлы.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	ДопустимыеРасширенияФайла = Константы.ДопустимыеРасширенияФайлов.Получить();
	
	Если Не ПустаяСтрока(ДопустимыеРасширенияФайла) Тогда 
		Если СтрНайти(ДопустимыеРасширенияФайла, РасширениеФайла) = 0 Тогда
			Сообщить(НСтр("ru = 'Допускаются файлы с расширениями '") + ДопустимыеРасширенияФайла);
			Возврат Справочники.Файлы.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(ДанныеФайла);
	
	Если Константы.МестоХраненияФайлов.Получить() = Перечисления.МестаХраненияФайлов.ЛокальныйДиск Тогда
		
		ИмяФайлаНаДиске = РаботаСФайламиСервер.СоздатьФайлНаДиске(КороткоеИмяФайла, ДанныеФайла, ИдентификаторФайла);
		
		// Создадим элемент справочника
		НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
		НовыйФайл.Наименование 			= КороткоеИмяФайла;
		НовыйФайл.ДатаЗагрузки 			= ТекущаяДата();
		НовыйФайл.МестоХранения			= Перечисления.МестаХраненияФайлов.ИнформационнаяБаза;
		НовыйФайл.Автор 				= Пользователь;
		НовыйФайл.ИмяФайлаНаДиске 		= ИмяФайлаНаДиске;
		НовыйФайл.Расширение 			= РасширениеФайла;
		НовыйФайл.Размер 				= РазмерФайла;
		НовыйФайл.ИдентификаторФайла 	= Строка(ИдентификаторФайла);
		НовыйФайл.MD5 					= СтрЗаменить(Строка(Хеш.ХешСумма), " ", "");
		
		Попытка
			НовыйФайл.Записать();
		Исключение
			Возврат Справочники.Файлы.ПустаяСсылка();
		КонецПопытки;
		
	Иначе
		
		// Создадим элемент справочника
		НовыйФайл = Справочники.Файлы.СоздатьЭлемент();
		НовыйФайл.Наименование 			= КороткоеИмяФайла;
		НовыйФайл.ДатаЗагрузки 			= ТекущаяДата();
		НовыйФайл.МестоХранения			= Перечисления.МестаХраненияФайлов.ИнформационнаяБаза;
		НовыйФайл.Автор 				= Пользователь;
		НовыйФайл.Расширение 			= РасширениеФайла;
		НовыйФайл.Размер 				= РазмерФайла;
		НовыйФайл.ИдентификаторФайла 	= Строка(ИдентификаторФайла);
		НовыйФайл.MD5 					= СтрЗаменить(Строка(Хеш.ХешСумма), " ", "");
		НовыйФайл.Данные 				= Новый ХранилищеЗначения(ДанныеФайла, Новый СжатиеДанных());
		
		Попытка
			НовыйФайл.Записать();
		Исключение
			Возврат Справочники.Файлы.ПустаяСсылка();
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат НовыйФайл.Ссылка;
	
КонецФункции

// Сохраняет на сервере загруженный пользователем файл во временную папку 
// и выдает структуру совместимую со справочником файла. Проверки файла отключены.
// Возвращает ссылку на элемент справочника.
// Параметры:
//  АдресВХранилище		- Строка - Адрес во временном хранилище, куда был помещен файл с клиента
//  КороткоеИмяФайла	- Строка - Название файла на клиенте
//
// Возвращаемое значение:
//  Структура - Структура, аналогичная справочнику файлы
// 
Функция ЗагрузитьВременныйФайл(АдресВХранилище, КороткоеИмяФайла) Экспорт
	
	ИдентификаторФайла = Новый УникальныйИдентификатор;

	Пользователь = ПараметрыСеанса.ТекущийПользователь;

	ЧастиИмениФайла = СтрРазделить(КороткоеИмяФайла, ".");
	РасширениеФайла = ЧастиИмениФайла[1];
	
	// Получим файл из временного хранилища
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	РазмерФайла = ДанныеФайла.Размер();

	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(ДанныеФайла);
	
	ПолныйПутьКФайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ИмяФайлаНаДиске = РаботаСФайламиКлиентСервер.КороткоеИмяФайлаИзПолногоПути(ПолныйПутьКФайлу);
	
	Попытка
		ДанныеФайла.Записать(ПолныйПутьКФайлу);
	Исключение 
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначенияСервер.ЗафиксироватьОшибку(НСтр("ru = 'Произошла ошибка при сохранении временного файла на диске.'"), ОписаниеОшибки, ПолныйПутьКФайлу);
		Возврат Справочники.Файлы.ПустаяСсылка();
	КонецПопытки;
	
	// Создадим элемент справочника
	ОписаниеФайла = Новый Структура();
	ОписаниеФайла.Вставить("Наименование", КороткоеИмяФайла);
	ОписаниеФайла.Вставить("ДатаЗагрузки", ТекущаяДата());
	ОписаниеФайла.Вставить("МестоХранения", Перечисления.МестаХраненияФайлов.ЛокальныйДиск);
	ОписаниеФайла.Вставить("Автор", Пользователь);
	ОписаниеФайла.Вставить("ИмяФайлаНаДиске", ИмяФайлаНаДиске);
	ОписаниеФайла.Вставить("ПолныйПутьКФайлу", ПолныйПутьКФайлу);
	ОписаниеФайла.Вставить("Расширение", РасширениеФайла);
	ОписаниеФайла.Вставить("Размер", РазмерФайла);
	ОписаниеФайла.Вставить("ИдентификаторФайла", Строка(ИдентификаторФайла));
	ОписаниеФайла.Вставить("MD5", СтрЗаменить(Строка(Хеш.ХешСумма), " ", ""));
	Возврат ОписаниеФайла.Ссылка;
	
КонецФункции
