// Если вресия в конфигурации не совпадает с версией в константе то делаем обновление
//
//Параметры
//
//Возвращаемое значение:
//	<Булево> - истина, если обновление произошло и было успешным
Функция ПроверитьОбновления() Экспорт
	
	РезультатОперации = "ОбновлениеНеНайдено";
	
	// Проверим версию конфигурации. Если текущая версия больше записанной то вызываем обработчик 
	Если ПолучитьВерсиюКонфигурации()<> ПолучитьЗарегистрированнуюВерсиюКонфигурации() Тогда
		
		Если Не РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
			Возврат "НедостаточноПрав";
		КонецЕсли;
		
		ОбработкаОбновления = Обработки.ОбновлениеКонфигурации.Создать();
		
		// Если обновление прошло удачно пишем новую версию конфигурации в константу
		Если  ОбработкаОбновления.ВыполнитьОбновлениеКонфигурации() Тогда
			ЗарегистрироватьВерсию(ПолучитьВерсиюКонфигурации());
			РезультатОперации = "ОбновлениеПроизведено";
		КонецЕсли;
		
		ОбработкаОбновления = Неопределено;
		
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Возвращает версию конфигурации
Функция ПолучитьВерсиюКонфигурации() Экспорт

	Возврат Метаданные.Версия;
	
КонецФункции // ПолучитьВерсиюКонфигурации()


// Возвращает версию конфигурации базы данных
Функция ПолучитьЗарегистрированнуюВерсиюКонфигурации() Экспорт

	Возврат	?(НЕ ЗначениеЗаполнено(Константы.ВерсияКонфигурации.Получить()),"0.0.0.0",Константы.ВерсияКонфигурации.Получить());

КонецФункции // ПолучитьВерсиюКонфигурации()

// Обновляет версию конфигурации базы данных
Процедура  ЗарегистрироватьВерсию(НоваяВерсия)

	Константы.ВерсияКонфигурации.Установить(НоваяВерсия);

КонецПроцедуры // ЗарегистрироватьВерсию()

