
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.Элементы.Найти("ТекущаяДата").Значение = ТекущаяДата();
	Список.Параметры.Элементы.Найти("ТекущаяДата").Использование = Истина;
	
	ИспользоватьГруппировкуКниг = Константы.ИспользоватьГруппировкуКниг.Получить();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ИспользоватьГруппировкуКниг Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
	Иначе
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		// Скроем группы
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоГруппа");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = Ложь;
		Отбор.Использование = Истина;
		СкрытьЭлемент("СписокКонтекстноеМенюСоздатьГруппу");
		СкрытьЭлемент("СписокКонтекстноеМенюПеренестиЭлемент");
		СкрытьЭлемент("СписокКонтекстноеМенюУровеньВверх");
		СкрытьЭлемент("СписокКонтекстноеМенюУровеньВниз");
		СкрытьЭлемент("ФормаСоздатьГруппу");
		СкрытьЭлемент("ФормаРежимПросмотра");
		СкрытьЭлемент("ФормаИерархическийСписок");	
		СкрытьЭлемент("ФормаСписок");
		СкрытьЭлемент("ФормаДерево");
		СкрытьЭлемент("ФормаПеренестиЭлемент");
		СкрытьЭлемент("ФормаУровеньВверх");
		СкрытьЭлемент("ФормаУровеньВниз");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкрытьЭлемент(ИмяЭлемента)

	Элемент = Элементы.Найти(ИмяЭлемента);
	Если Элемент <> Неопределено Тогда
		Элемент.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры