#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда // Для работы толстого клиента https://its.1c.ru/db/v8std#content:680:hdoc

// Определим реквизиты создаваемых задач
Процедура ВыдачаКнигиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Определяем исполнителя
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ЗаказКниги.ТочкиМаршрута.ВыдачаКниги Тогда
		// Проверим значение в константе, так как устанавливаем исполнителя из нее
		Если НЕ ЗначениеЗаполнено(Константы.ОтветственныйЗаВыдачуКниг.Получить()) Тогда
			Сообщить(НСтр("ru = 'Не установлена константа ""ОтветственныйЗаВыдачуКниг"". Задача не может быть сформирована.'"));
			Отказ = Истина;
		КонецЕсли;
		// Заполним значения исполнителя для всех задач, но тут должна быть одна задача
		Для каждого Задача Из ФормируемыеЗадачи Цикл
			Задача.Исполнитель = Константы.ОтветственныйЗаВыдачуКниг.Получить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Перед записью БП надо определить автора, то бы знать кому нужны книги
Процедура ПередЗаписью(Отказ)
	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
		Сообщить(НСтр("ru = 'Текущий пользователь не зарегистрирован. Нельзя записать БП без указания пользователя.'"));
		Отказ = Истина;
	КонецЕсли;
	// Проверим заполнена ли константа ответственного за выдачу книг
	Если НЕ ЗначениеЗаполнено(Константы.ОтветственныйЗаВыдачуКниг.Получить()) Тогда
		Сообщить(НСтр("ru = 'Не установлена константа ""ОтветственныйЗаВыдачуКниг"". Задача не может быть сформирована.'"));
		Отказ = Истина;
	КонецЕсли;
	// Проверим есть ли у пользователя привязка к абоненту
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.Абонент) Тогда
		Сообщить(НСтр("ru = 'Текущий пользователь не привязан к абоненту. Задача не может быть сформирована.'"));
		Отказ = Истина;
	КонецЕсли;
	ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	// Определим есть ли такие книги в библиотеке
	МассивСсылокКниг = Новый Массив;
	// Создадим массив книг из заказа
	Для каждого Строка Из ЭтотОбъект.КнигиКЗаказу Цикл
		МассивСсылокКниг.Добавить(Строка.Книга);
	КонецЦикла;	
	// Вызовем функцию которая возвращает те книги которые надо удалить
	МассивСсылокКниг = ОбщегоНазначенияСервер.ПроверитьОстаткиВБиблиотеке(Истина, ЭтотОбъект.Дата, МассивСсылокКниг);
	// Если они есть
	Если МассивСсылокКниг.Количество() > 0 Тогда
		Сообщение = НСтр("ru = 'Данных книг нет в библиотеке они удалены из заказа:'") + Символы.ПС;
		// То формируем сообщение
		Для каждого Книга из МассивСсылокКниг Цикл
			Сообщение = Сообщение + Книга +  Символы.ПС; 
			// И удаляем
			ЭтотОбъект.КнигиКЗаказу.Удалить(ЭтотОбъект.КнигиКЗаказу.Найти(Книга, "Книга"));
		КонецЦикла;
		Сообщить(Сообщение);
	КонецЕсли;
	// Если таб часть пуста то отменяем заказ книги	
	Если ЭтотОбъект.КнигиКЗаказу.Количество() = 0 Тогда
		Сообщить(НСтр("ru = 'В табличной части нет Книг. Заказ не сформирован'"));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

// Заполним реквизиты задачи возврата книг
Процедура ВозвратКнигиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ЗаказКниги.ТочкиМаршрута.ВозвратКниги Тогда
		// Заполним значения исполнителя для всех задач, но тут должна быть одна задача
		Для каждого Задача из ФормируемыеЗадачи Цикл
			Задача.Исполнитель = ЭтотОбъект.Автор;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
