#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда // Для работы толстого клиента https://its.1c.ru/db/v8std#content:680:hdoc

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОбщегоНазначенияСервер.ПроверитьНаОдинаковыеПозиции(Книги, Отказ);
	
	Для Каждого ТекСтрокаКниги Из Книги Цикл
		// Регистр КнигиВБиблиотеке Приход
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;
		Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
		Движение.Операция =  Перечисления.Операция.ПоступлениеКниг;
		Движение.Количество = 1;
	КонецЦикла;
	
КонецПроцедуры

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли