
Процедура ОбработкаПроведения(Отказ, Режим)		
	ОбщегоНазначения.ПроверитьНаОдинаковыеПозиции(Книги, Отказ);
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаКниги Из Книги Цикл
		// регистр КнигиВБиблиотеке Приход
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;		
		Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
		Движение.Операция =  Перечисления.Операция.ПоступлениеКниг;
		Движение.Количество = 1;
	КонецЦикла;	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


