//при изменении строки перечитываем авторов
&НаКлиенте
Процедура КнигиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элемент.ТекущиеДанные.Авторы = ПолучитьСтрокуАвторовВызов(Элемент.ТекущиеДанные.Книга);	
КонецПроцедуры

//при открытии формы перечитываем авторов книг
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для каждого СтрокаТЧ из Объект.Книги цикл
		СтрокаТЧ.Авторы = ПолучитьСтрокуАвторовВызов(СтрокаТЧ.Книга);	
	КонецЦикла;
КонецПроцедуры

//данная функция предназначена для вызова функции(серв) общего глобального модуля
//потому что я еще не понял как из клиентской процедуры модуля управляемой формы \
//вызвать серверную процедуру общего глобального модуля
&НаСервере
Функция ПолучитьСтрокуАвторовВызов(СсылкаНаКнигу)
	Возврат ОбщегоНазначения.ПолучитьСтрокуАвторов(СсылкаНаКнигу);	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//если в документ был передан массив книг
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.МассивКниг)
		И Объект.Книги.Количество()=0 Тогда
		Для каждого Книга из ЭтаФорма.Параметры.МассивКниг цикл
			НоваяСтрока = Объект.Книги.Добавить();
			НоваяСтрока.Книга = Книга;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
