// Создает нового автора
//
// Параметры:
//  Наименование  - <Строка> - наименование автора
//
// Возвращаемое значение:
//   <СправочникСсылка.Авторы>   - созданное издательство
//
Функция СоздатьАвтора(Наименование) Экспорт
	
	АвторОбъект = Справочники.Авторы.СоздатьЭлемент();
	АвторОбъект.Наименование = Наименование;
	Попытка
		АвторОбъект.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось создать автора";
		СообщениеПользователю.Сообщить();
		ОбщегоНазначения.ЗафиксироватьОшибку(СообщениеПользователю.Текст, ОписаниеОшибки, Метаданные.Справочники.Авторы, Наименование);
	КонецПопытки;
	
	Возврат АвторОбъект.Ссылка;
	
КонецФункции // СоздатьАвтора()
